brendenvogt/betaflight-esp32/components/bv_utils/esp32/Preferences.h
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#ifndef _PREFERENCES_H_
#define _PREFERENCES_H_

#include <math.h>
#include <string>
#include <stdint.h>

#include "nvs.h"
#include "esp32-hal-log.h"
#include <cstring>

class Preferences
{
  protected:
    uint32_t _handle;
    bool _started;
    bool _readOnly;

  public:
    Preferences();
    ~Preferences();

    bool begin(const char *name, bool readOnly = false);
    void end();

    bool clear();
    bool remove(const char *key);

    size_t putChar(const char *key, int8_t value);
    size_t putUChar(const char *key, uint8_t value);
    size_t putShort(const char *key, int16_t value);
    size_t putUShort(const char *key, uint16_t value);
    size_t putInt(const char *key, int32_t value);
    size_t putUInt(const char *key, uint32_t value);
    size_t putLong(const char *key, int32_t value);
    size_t putULong(const char *key, uint32_t value);
    size_t putLong64(const char *key, int64_t value);
    size_t putULong64(const char *key, uint64_t value);
    size_t putFloat(const char *key, float_t value);
    size_t putDouble(const char *key, double_t value);
    size_t putBool(const char *key, bool value);
    size_t putString(const char *key, const char *value);
    size_t putString(const char *key, std::string value);
    size_t putBytes(const char *key, const void *value, size_t len);

    int8_t getChar(const char *key, int8_t defaultValue = 0);
    uint8_t getUChar(const char *key, uint8_t defaultValue = 0);
    int16_t getShort(const char *key, int16_t defaultValue = 0);
    uint16_t getUShort(const char *key, uint16_t defaultValue = 0);
    int32_t getInt(const char *key, int32_t defaultValue = 0);
    uint32_t getUInt(const char *key, uint32_t defaultValue = 0);
    int32_t getLong(const char *key, int32_t defaultValue = 0);
    uint32_t getULong(const char *key, uint32_t defaultValue = 0);
    int64_t getLong64(const char *key, int64_t defaultValue = 0);
    uint64_t getULong64(const char *key, uint64_t defaultValue = 0);
    float_t getFloat(const char *key, float_t defaultValue = NAN);
    double_t getDouble(const char *key, double_t defaultValue = NAN);
    bool getBool(const char *key, bool defaultValue = false);
    size_t getString(const char *key, char *value, size_t maxLen);
    std::string getString(const char *key, std::string defaultValue = std::string());
    size_t getBytes(const char *key, void *buf, size_t maxLen);
};

#endif
